
import Product.Product;
import java.util.*;

public class Laba_7 {

    public static void main(String[] args) {
        List<Product> basket = new ArrayList<Product>();

        Random rand = new Random();
        int basketSize = rand.nextInt(150) + 100;
        for (int i = 0; i < basketSize; i++) {
            Product newProduct = generateProduct(rand);

            if (findProductIndex(basket, newProduct.getNameProduct()) != -1) {
                i--;
            } else {
                basket.add(newProduct);
            }

        }

        Iterator<Product> iterator = basket.iterator();

        while (iterator.hasNext()) {
            Product product = iterator.next();
            if (product.getPriceProduct() > 1000 || product.getWeightProduct() > 4) {
                iterator.remove();
            }
        }

        Collections.sort(basket, (p1, p2) -> p1.getNameProduct().compareTo(p2.getNameProduct()));

        String favoriteProduct = "Огурец";
        int index = findProductIndex(basket, favoriteProduct);
        if (index != -1) {
            Product buf;
            buf = basket.get(0);
            basket.set(0, basket.get(index));
            basket.set(index, buf);
        } else {
            System.out.println(favoriteProduct + " не найден.");
        }

        System.out.println("\nПродукты дешевле 10 и тяжелее 2:\n");
        for (Product p : basket) {
            if (p.getPriceProduct() < 10 && p.getWeightProduct() > 2) {
                System.out.println("- " + p.getNameProduct() + " " + p.getPriceProduct() + " " + p.getWeightProduct());
            }
        }
        System.out.println("\nПолный список продуктов:\n");
        basket.forEach(p -> System.out.println("- " + p.getNameProduct() + " " + p.getPriceProduct() + " " + p.getWeightProduct()));
    }

    static public Product generateProduct(Random rand) {
        List<String> titlesList = new ArrayList<String>(Arrays.asList("Яблоко", "Банан", "Апельсин", "Груша", "Вишня", "Клубника", "Малина", "Чёрная смородина", "Прасковка", "Манго", "Ананас", "Грейпфрут", "Киви", "Персик", "Лимон", "Лайм", "Свежая малина", "Черника", "Арбуз", "Дыня", "Картофель", "Морковь", "Брокколи", "Цветная капуста", "Шпинат", "Огурец", "Помидор", "Перец", "Лук", "Чеснок", "Кабачок", "Баклажан", "Редис", "Сельдерей", "Петрушка", "Укроп", "Салат", "Капуста", "Маслины", "Оливки", "Молоко", "Йогурт", "Творог", "Сметана", "Сыр", "Масло", "Кефир", "Ряженка", "Десерт из творога", "Молочный коктейль", "Курица", "Говядина", "Свинина", "Индейка", "Бекон", "Колбаса", "Сосиски", "Филе рыбы", "Креветки", "Баранина", "Рис", "Гречка", "Перловка", "Овсянка", "Киноа", "Нут", "Фасоль", "Чечевица", "Пшеница", "Ячмень", "Грецкие орехи", "Миндаль", "Фундук", "Кешью", "Семена подсолнечника", "Семена тыквы", "Чиа", "Льняные семена", "Кокос", "Арахис", "Шоколад", "Конфеты", "Печенье", "Торт", "Кекс", "Пирожное", "Маффин", "Блинчики", "Вафли", "Мармелад", "Вода", "Чай", "Кофе", "Сок", "Компот", "Коктейль", "Газировка", "Энергетик", "Квас", "Молочный коктейль", "Соль", "Перец", "Орегано", "Тимьян", "Укроп", "Базилик", "Паприка", "Чили", "Корица", "Карри", "Хлеб", "Булочка", "Лаваш", "Пита", "Чиабатта", "Багет", "Панкейки", "Пирог", "Пицца", "Тортилья", "Морозильные овощи", "Замороженные фрукты", "Замороженное мясо", "Пельмени", "Покетти", "Замороженные пирожки", "Замороженные блины", "Мороженое", "Замороженные пиццы", "Лед к коктейлю", "Чипсы", "Попкорн", "Орешки", "Сухарики", "Слайсы сыра", "Оливки", "Нори (водоросли)", "Роллы", "Фрукты в шоколаде", "Кукуруза в початках", "Грибной суп", "Овощной суп", "Борщ", "Рассольник", "Курячий бульон", "Уха", "Томатный суп", "Чили", "Куриный суп", "Гороховый суп", "Кисломолочное молоко", "Обезжиренный йогурт", "Кислое молоко", "Сырые сливки", "Молоко с пробиотиками", "Кефир с зеленью", "Творожный крем", "Брынза", "Мягкий сыр", "Мини-моцарелла", "Готовые шашлыки", "Замороженные котлеты", "Готовая пицца", "Замороженные разгрузочные овощи", "Готовые соусы", "Готовые обжаренные уши", "Свиные отбивные", "Фарш из курятины", "Мясной гуляш", "Котлеты по-киевски", "Лапша", "Консервированные помидоры", "Лавровый лист", "Мука", "Разрыхлитель теста", "Сахар", "Ванильный сахар", "Мед", "Соевый соус", "Томатная паста", "Брускетта", "Тосты с авокадо", "Мясные закуски", "Овощные закуски", "Салат \"Цезарь\"", "Закуска из лаваша", "Ореховая нарезка", "Паста с чесноком", "Капрезе", "Антипасти", "Кари с кокосом", "Карамельный соус", "Зеленый чай с жасмином", "Гуакамоле", "Хумус", "Мисо паста", "Тапенада", "Песто", "Цацики", "Кандиданты", "Пудинг", "Тирамису", "Шарлотка", "Фруктовый салат", "Морозное", "Сахарные блошки", "Крем-брюле", "Парфе", "Брауни", "Яблочный пирог", "Фруктовый смузи", "Сбитень", "Молочный чаи", "Кокосовая вода", "Томатный сок", "Угольный напиток", "Имбирный эль", "Ягоды нектар", "Лимонный лимонад", "Пармезан", "Хлебные крошки", "Икра", "Фладж", "Оленья ветчина", "Черепаший бульон", "Запеченная свинина", "Сыр Фета", "Копченая рыба", "Кальмары", "Овсянка", "Яичница", "Греческий йогурт", "Суп из овсянки", "Блины с начинкой", "Сырники", "Каша с фруктами", "Бутерброды", "Кукурузные хлопья", "Французский тост", "Рис с морепродуктами", "Паста с соусом", "Фахита", "Овощи-гриль", "Такос", "Ризотто", "Крем-суп", "Лазанья", "Пельмени", "Чили кон карне", "Финики", "Сушеный манго", "Мандариновое пюре", "Сушеные помидоры", "Чеснок в масле", "Томатные чипсы", "Папайя", "Вяленые анчоусы", "Сушеные абрикосы", "Пастила", "Спред", "Тосты", "Чипсы с соусом", "Гренки", "Лососевые рулетики", "Запеченные корнеплоды", "Корейский салат", "Заказать", "Чечевичные чипсы", "Ароматный перец", "Ванильный пудинг", "Грушевое желе", "Фисташковый мусс", "Миндальные печенья", "Лимонный тарт", "Лавровый крем", "Пирог с лососем", "Грибы с сыром", "Бинго с чаем", "Крикеты"));

        int price = rand.nextInt(100) + 1;
        int weight = rand.nextInt(8) + 1;
        String title = titlesList.get(rand.nextInt(279));
        Product newArticle = new Product(title, price, weight);
        return newArticle;
    }

    static int findProductIndex(List<Product> basket, String productName) {
        for (int i = 0; i < basket.size(); i++) {
            if (basket.get(i).getNameProduct().equals(productName)) {
                return i;
            }
        }
        return -1; // Если не найден
    }
}
